app/controllers/todolists_controller.rb

SELECT "todolists".* FROM "todolists"
---
  def index
    @todolists = Todolist.all

INSERT INTO "todolists" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Le retest"], ["description", "Bordel !!"], ["created_at", "2018-09-23 15:36:06.221707"], ["updated_at", "2018-09-23 15:36:06.221707"]]
---
  def create
    @todolist = Todolist.new(todolist_params)

    if @todolist.save

UPDATE "todolists" SET "name" = $1, "updated_at" = $2 WHERE "todolists"."id" = $3  [["name", "A new post"], ["updated_at", "2018-09-23 17:35:14.651772"], ["id", 1]]
---
  def update
    if @todolist.update(todolist_params)

DELETE FROM "todolists" WHERE "todolists"."id" = $1  [["id", 2]]
---
  def destroy
    @todolist.destroy

SELECT  "todolists".* FROM "todolists" WHERE "todolists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_todolist
    @todolist = Todolist.find(params[:id])